In [2]:
import numpy as np
import pandas as pd

### Series

In [5]:
# creating objects
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [9]:
# creating a series
# note that a numeric index is automatically created
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
# creating your own index
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [11]:
# you can also do this without the assignment labels
# as long as everything's in the right order
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [12]:
# using the numpy array
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [14]:
# does the same thing with labels
# using the numpy array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [16]:
# using a dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

#### as opposed to a numpy array, a pandas Series can hold a variety of object types

In [17]:
# we've seen numbers - see strings
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [18]:
# using built in functions
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4],index=['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [21]:
ser2 = pd.Series([1,2,5,4],index=['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [23]:
# getting data out similar to a python dict
ser1['USA']

1

In [24]:
ser1[2:]

USSR     3
Japan    4
dtype: int64

In [25]:
ser2[:3]

USA        1
Germany    2
Italy      5
dtype: int64

In [27]:
# notice that where an entry isn't in both ser1 and ser2, pandas didn't carry the value - it returns NaN
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [28]:
# DataFrames are the main object type when working in Pandas

In [31]:
from numpy.random import randn
# You can set a random seed so that multiple tests will have consistent output
np.random.seed(101)

#### format - data (generated by randn and shaped), Row index (5 letters to match the 5), and Column Index (4 letters To match the 4)
-----
*5 rows, 4 columns*

*df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','X'])*

Each Column is a Pandas Series.

**A DataFrame is just a collection of Series that share a common Index**

In [110]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018
E -0.131906 -1.335092 -0.089298  0.698566

### using indexing and selection

**getting columns**

In [111]:

# Return the W Column (the Series)
df['W']

A   -0.298436
B    0.863596
C    1.201744
D   -0.854860
E   -0.131906
Name: W, dtype: float64

In [112]:
# Slices work
df[:2]

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027

In [113]:
# Can call by .Name
# Not recommended (.<name> might clash with a .method_name)
df.W

A   -0.298436
B    0.863596
C    1.201744
D   -0.854860
E   -0.131906
Name: W, dtype: float64

In [114]:
# bracket notation. Preferred
df['W']

A   -0.298436
B    0.863596
C    1.201744
D   -0.854860
E   -0.131906
Name: W, dtype: float64

In [115]:
# get a list of columns
df[['W','Z']]

          W         Z
A -0.298436 -1.839261
B  0.863596  1.209027
C  1.201744 -1.524856
D -0.854860 -0.994018
E -0.131906  0.698566

In [116]:
# creating a new column in-place
# This fails
df['new']

KeyError: 'new'

In [ ]:
df['new'] = df['W']+df['Y']
df['new']

In [ ]:
# Column added
df

In [ ]:
# Drop a column
# Default will be to drop a row - axis=0. df.drop('new') will error since 'new' isn't a row
# to drop a named column, use axis=1
df.drop('new',axis=1)

In [ ]:
# Doesn't happen in place - notice df still has the column
df

In [ ]:
# Need to add the in-place argument to delete it from the dataframe. Default inplace=False for data protection
df.drop('new',axis=1,inplace=True)

In [ ]:
# column removed
df

In [ ]:
# dropping rows (eq to df.drop('E',axis=0))
df.drop('E')

In [ ]:
# not dropped in-place
df

In [ ]:
# to drop from the dataframe in-place
#df.drop('E',inplace=#True)

In [117]:
df

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018
E -0.131906 -1.335092 -0.089298  0.698566

In [119]:
# axis 0 and 1 are set because pandas is built on numpy
# You can see the shapes in the same way you see numpy.shape
df.shape

(5, 4)

#### Selecting rows

In [123]:
# to get a row, use .loc and the label.

df.loc['A']

W   -0.298436
X    0.029141
Y    0.889031
Z   -1.839261
Name: A, dtype: float64

In [125]:
# This returns a Series
type(df.loc['A'])

pandas.core.series.Series

In [128]:
# using index position
# to get row C we can use the index 2 instead of .loc['C']
df.iloc[2]

W    1.201744
X   -0.820463
Y   -1.029577
Z   -1.524856
Name: C, dtype: float64

**Using column notation**

In [133]:
# Using comma notation to subselect using .iloc:
df.iloc[1,2]

-0.580382983225663

In [136]:
# or with .loc and the labels
df.loc['B','Y']

-0.580382983225663

In [137]:
# Using Lists for multiple values
df.loc[['A','B'],['Y','Z']]

          Y         Z
A  0.889031 -1.839261
B -0.580383  1.209027

### Conditional Selection

In [142]:
# Search for all dataframe values greater than 0
# Similar to numpy arrays
df > 0

       W      X      Y      Z
A  False   True   True  False
B   True  False  False   True
C   True  False  False  False
D  False   True   True  False
E  False  False  False   True

In [147]:
# create a dataframe of the boolean output
# show all non-negative values
bool_df = df > 0
bool_df

       W      X      Y      Z
A  False   True   True  False
B   True  False  False   True
C   True  False  False  False
D  False   True   True  False
E  False  False  False   True

In [150]:
# pass that dataframe back to the original dataframe
# to get a dataframe that only shows positive values
df[bool_df]

          W         X         Y         Z
A       NaN  0.029141  0.889031       NaN
B  0.863596       NaN       NaN  1.209027
C  1.201744       NaN       NaN       NaN
D       NaN  1.602816  0.185479       NaN
E       NaN       NaN       NaN  0.698566

In [151]:
# combine into 1 step
df[df > 0]

          W         X         Y         Z
A       NaN  0.029141  0.889031       NaN
B  0.863596       NaN       NaN  1.209027
C  1.201744       NaN       NaN       NaN
D       NaN  1.602816  0.185479       NaN
E       NaN       NaN       NaN  0.698566

In [152]:
df

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018
E -0.131906 -1.335092 -0.089298  0.698566

In [155]:
# SubSelect using a row or column value
# returns a Series
df['W'] > 0

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [159]:
# combine to filter out rows that match the conditions
# return only those rows in the dataframe where the value of 'W' is positive
# This removes all the null value returns - that only happens when evaluating a whole dataframe
# This method analyzes based on the columns
df[df['W']>0]

          W         X         Y         Z
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856

In [160]:
# grab all the rows in the dataframe where Z < 0
df[df['Z']<0]

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018

**These commands return DataFrames in response. So you can run commands off of the dataframe output**

In [166]:
# creating a new dataframe
resultdf = df[df['W']>0]
resultdf

          W         X         Y         Z
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856

In [168]:
# Now return only the X column where that is true
resultdf['X']

B   -1.076591
C   -0.820463
Name: X, dtype: float64

In [169]:
# Now do that in one step by stacking commands in bracket notation
df[df['W']>0]['X']

B   -1.076591
C   -0.820463
Name: X, dtype: float64

In [171]:
# can also bracket for multiple columns by passing in a list
df[df['W']>0][['X','Y']]

          X         Y
B -1.076591 -0.580383
C -0.820463 -1.029577

In [174]:
# create a series 
boolser = df['W']>0
boolser

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [176]:
# make a dataframe from the df[series]
result = df[boolser]
result

          W         X         Y         Z
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856

In [180]:
# Now call a subset of columns from that as a list
result[['Y','X']]

          Y         X
B -0.580383 -1.076591
C -1.029577 -0.820463

In [183]:
# same operation, but using a named list
mycols=['Y','X']
result[mycols]

          Y         X
B -0.580383 -1.076591
C -1.029577 -0.820463

In [185]:
# and, from the earlier summary
df[df['W']>0][mycols]

          Y         X
B -0.580383 -1.076591
C -1.029577 -0.820463

### Using multiple conditions

In [195]:
# intentional bad example to show off the "truth value of a Series is ambiguous" error
# the and operator can only take in single booleans, not Series of booleans
# Notice also that we're separating the conditions in parentheses (cond1) and (cond2)
df[(df['W']>0) and (df['Y']< 1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [197]:
# The fix - use & operator
df[(df['W']>0) & (df['Y']< 1)]

          W         X         Y         Z
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856

In [199]:
# or using | operator
# The fix - use & operator
df[(df['W']>0) | (df['Y']> 1)]

          W         X         Y         Z
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856

In [200]:
df

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018
E -0.131906 -1.335092 -0.089298  0.698566

In [201]:
# In order to reset the range index, use the .reset_index() method
df.reset_index()

  index         W         X         Y         Z
0     A -0.298436  0.029141  0.889031 -1.839261
1     B  0.863596 -1.076591 -0.580383  1.209027
2     C  1.201744 -0.820463 -1.029577 -1.524856
3     D -0.854860  1.602816  0.185479 -0.994018
4     E -0.131906 -1.335092 -0.089298  0.698566

In [203]:
# (not changed because inplace=False by default)
df

          W         X         Y         Z
A -0.298436  0.029141  0.889031 -1.839261
B  0.863596 -1.076591 -0.580383  1.209027
C  1.201744 -0.820463 -1.029577 -1.524856
D -0.854860  1.602816  0.185479 -0.994018
E -0.131906 -1.335092 -0.089298  0.698566

In [210]:
#### set the index to a new column

In [207]:
# Setting the index using .split() from a string
new_ind = 'CA NY WY OR CO'.split() # split returns a list
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [209]:
df['States'] = new_ind
df

          W         X         Y         Z States
A -0.298436  0.029141  0.889031 -1.839261     CA
B  0.863596 -1.076591 -0.580383  1.209027     NY
C  1.201744 -0.820463 -1.029577 -1.524856     WY
D -0.854860  1.602816  0.185479 -0.994018     OR
E -0.131906 -1.335092 -0.089298  0.698566     CO

In [213]:
# return the dataframe with States as the index (inplace=False)
df.set_index('States')

               W         X         Y         Z
States
CA     -0.298436  0.029141  0.889031 -1.839261
NY      0.863596 -1.076591 -0.580383  1.209027
WY      1.201744 -0.820463 -1.029577 -1.524856
OR     -0.854860  1.602816  0.185479 -0.994018
CO     -0.131906 -1.335092 -0.089298  0.698566

## Multi-Index and Index Hierarchy

create a quick example of what a Multi-Indexed DataFrame:

In [218]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [215]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [216]:
inside

[1, 2, 3, 1, 2, 3]

In [217]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [221]:
# This shows multiple levels of an index - Index Hierarchy
df = pd.DataFrame(randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.004056  1.031916
   2 -1.081118 -0.000355
   3 -0.219882  0.292795
G2 1  0.834355 -0.140432
   2  0.119145  0.665715
   3  0.407586  0.807843

In [224]:
# Calling Data from Multi-level Index
# Call from Outside Index to Inside
df.loc['G1'].iloc[1]

A   -1.081118
B   -0.000355
Name: 2, dtype: float64

In [225]:
#Add naming to index names:
# currently unset
df.index.names

FrozenList([None, None])

In [228]:
# Give them names:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1    1.004056  1.031916
       2   -1.081118 -0.000355
       3   -0.219882  0.292795
G2     1    0.834355 -0.140432
       2    0.119145  0.665715
       3    0.407586  0.807843

In [236]:
# Grab g2, number 2, B - my solution
df.loc['G2'].iloc[1]['B']

0.6657145861587476

In [237]:
# Grab g2, number 2, B - his solution
df.loc['G2'].loc[2]['B']

0.6657145861587476

In [238]:
# Cross Sections of Rows or Columns using .xs() method
df.xs('G1')

            A         B
Num
1    1.004056  1.031916
2   -1.081118 -0.000355
3   -0.219882  0.292795

In [251]:
# Cross Sections with .xs()
# Find all groups where index"Num" == 1
df.xs(1,level='Num')

               A         B
Groups
G1      1.004056  1.031916
G2      0.834355 -0.140432

In [252]:
# Cross Sections with .xs()
# Find all groups where index"Num" == 3
df.xs(3,level='Num')

               A         B
Groups
G1     -0.219882  0.292795
G2      0.407586  0.807843

## Missing Data

In [254]:
# If you're missing data, Pandas will automatically fill it in with Null or NaN
# Use .dropna or .fillna to remove or fill missing values

In [259]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
# import the dataframe from dictionary D
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### using dropna()

In [262]:
# Using .dropna()
# drop any row will null or missing values by default
# to drop by columns use the axis=1 argument
df.dropna()

     A    B  C
0  1.0  5.0  1

In [263]:
# by columns
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [267]:
# using the thresh argument - number of good values must at least thresh
# e.g. row 1 has at least 2 valid values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### using fillna()

In [1]:
df.fillna(value='FILL VALUE')

NameError: name 'df' is not defined

In [273]:
# fill in missing values in A with the mean of column A
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GroupBy

In [275]:
# group rows based on a column, then perform some sort of aggregate functions on them

In [276]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [277]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [278]:
# returns an object
df.groupby('Company')

In [280]:
bycomp = df.groupby('Company')

In [285]:
# now call an aggregate function like the mean
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [284]:
# or the sum
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [286]:
# or the standard deviation
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [288]:
# notice that it returns a dataframe, so dataframe operations work
# grab the sum of sales only from Facebook
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [289]:
# in one line
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [292]:
# Also counting elements
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [293]:
# or max

In [294]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [295]:
# or min
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [296]:
# You can also use it with .describe() to get a good summary of data contains
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [302]:
# You can also transpose the output with .transpose()
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [303]:
# and call column names
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

### Merging, Joining and Concatenating

In [304]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [305]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [306]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

### Concatenation

Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [307]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [316]:
# concatenate them all along the rows
pd.concat([df1,df2,df3]) # same as axis=0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [318]:
# concatenate them all along the columns
# notice the missing values and how they form a diagonal
# most often concatenating along columns (axis=1)
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging DataFrames

In [328]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [327]:
# Simple merge
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [330]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [331]:
# more complicated examples
#
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [332]:
# merge outer
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [337]:
# merge right
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

## Joining

Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [339]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [340]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [341]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [342]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Finding unique values in a dataframe

In [349]:
# using .unique()
# Show the values
df['col2'].unique()

array([444, 555, 666])

In [346]:
# How many unique values? Python way
len(df['col2'].unique())

3

In [347]:
 # Pandas way
df['col2'].nunique()

3

In [352]:
# Counting values
#Using value counts
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [353]:
df[df['col1']> 2] # remember that the internal operation is just comparing boolean values

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [354]:
# e.g
df['col1']> 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [359]:
# can also wrap the conditions in parens and compare with & or | 
# find for col1 > 2 and col2 > 444
df[(df['col1']> 2) & (df['col2'] >444)]

   col1  col2 col3
2     3   666  ghi

### The .apply() method - very powerful

In [360]:
def times2(x):
    return x * 2

In [362]:
# You can easily return a built in function like .sum(). 
# How to apply custom functions, like times2?

In [364]:
df['col1'].apply(times2) # no () at the end of your custom function

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [366]:
# find the length of the strings in column 3
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [370]:
# especially powerful with lambda expressions
df['col2'].apply(lambda x: x** 2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

#### Removing columns

In [371]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [373]:
# remember that columns require axis=1, and that removing the column in-place needs inplace=true
# otherwise you return a view of the dataframe, not a changed dataframe
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [374]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [375]:
# if you want to get the column names
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [377]:
# also for indexes
df.index

RangeIndex(start=0, stop=4, step=1)

**sorting and ordering dataframes**

In [381]:
df.sort_values(by='col2') # the 'by' is a redundant default
# notice how the index stays attached to the row

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

 **how to find null values**

In [384]:
df.isnull() # returns booleans  - no null values in this df

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [386]:
# drop nulls in the returns
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### filling na values with something else

In [392]:
df.fillna('FILL')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### Pivot Tables

In [395]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [391]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [396]:
# pivot_table takes three values - values,index and columns 
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

## Data Input and Output


This will focus on 4 data types: CSV, Excel, HTML and SQL

#### CSV

In [401]:
# pandas can read from a lot of files - use pd.read_<tab> for a full list
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [403]:
df.to_csv('my_output',index=False) # index=false will not save the Index values as a column

#### Excel

**reading files in:**

In [406]:
# Pandas can only import data, not images/macros, etc
# 
# Excel treats each workbook like a bunch of sheets and each sheet is a dataframe 
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1') # new syntax is sheet_name

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

**writing files out:**

In [408]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet2')

#### HTML

**Input:**

In [428]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [413]:
# This converts HTML Tables into a DataFrame. Some things won't copy well
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
1,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
2,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
3,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
4,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","January 29, 2019"

### SQL

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [434]:
# import modules and create connection
from sqlalchemy import create_engine
# 'mysql://user:pass@localhost'
engine = create_engine('sqlite:///:memory:')
#engine = create_engine('mysql://divers:password@suckerpun.ch:2112')

In [435]:
# create a dataframe
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [436]:
# inject the dataframe into sql/sqlite
df.to_sql('data', engine)

In [437]:
# retrieve the dataframe from SQL
sql_df = pd.read_sql('data',con=engine)
sql_df

  index         W         X         Y         Z
0     A  1.290230 -1.478319  0.214234 -0.240510
1     B -1.420949  0.321660  1.007324  0.329784
2     C  0.920525  1.349138 -0.377861  1.955420
3     D -0.858304 -0.222210 -0.051203 -0.439128
4     E -1.501041  1.058357  1.854967  0.502250